# Расходуемые предметы

Consumable_items = {"fireball": ["damage", 20, 3]}

#  название : [атака, атака огнем, вампиризм%]
items_sword = {"rusty sword": [5, 0, 0],
               "fire sword": [10, 5, 10]}
#  название : [1)Максимум хп, 2)восстановление здововья, 3)атака, 4)атака(множитель), 5)атака огнем,
#  6)атака ядом, 7)вампиризм, 8)дополнительная защита, 9)шанс промаха%, 10)шанс промаха%(дебафф на врага),
#  11)эффект масла(значение влияет только на шанс промаха, увееличение урона от огня фиксированное)]
items_artefacts = {
    "Ash": [0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0],
    "Lantern": [0, 0, 0, 0, 0, 0, 0, -5, 5, 0],
    "MegaShield": [0, 0, 0, 0, 0, 0, 0, 8, 0, 0, 0],
    "Heart": [100, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    "Vampire Tooth": [0, 0, 7, 0, 0, 0, 15, 0, 0, 0, 0],
    "Poison bottle": [0, 0, 0, 0, 0, 15, 0, 0, 0, 0, 0],
    "Oil bottle": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5],
    "Blessing": [50, 2, 5, 0, 0, 0, 0, 3, -3, 0, 0],
    "Torch": [0, 0, 0, 0, 7, 0, 0, 0, -3, 0, 0],
    "Ice cage": [0, 0, 0, 0, 0, 0, 0, 15, 10, 0, 0]
}
